{
    "extention_name": "Untamed Now Playing",
    "extention_des": "Save 'now playing' data from music websites locally",
    "options_button_title": "Open options page",
    "yes": "Yes",
    "no": "No",
    "username": "Username",
    "save": "Save",
    "nav_options": "Options",
    "nav_sites": "Site Features",
    "nav_about": "About",
    "nav_change": "Changelog",
    "nav_contact": "Contact",
    "opt_saved": "Settings have been saved",
    "opt_des": "Click the icon beside each option for more information",
    "opt_donate": "If you find this extension useful, I'd really appreciate it if you consider donating to charity:water, they are a fantastic charity which give 100% of donations to people in need. <a target='_blank' href='http://vimeo.com/22566556'>Click here</a> to find out more, or to donate, <a target='_blank' href='https://donate.charitywater.org/dual/general_for_split/monthly_for_split'>click here</a>.",
    "opt_donate_2": "",
    "opt_0": "Save to directory",
    "opt_1": "Save as format",
    "opt_1_select_txt": "Plain text (txt)",
    "opt_1_select_xml": "XML",
    "opt_1_select_json": "JSON",
    "opt_1_select_multi": "Multiple txt files",
    "opt_2": "Filename",
    "opt_3": "Plain text now playing format",
    "opt_4": "Variable maximum length",
    "opt_4_des": "Append longer strings with '...'",
    "opt_5": "Download album artwork",
    "opt_6": "Disable YouTube parsing",
    "opt_7": "Integrate with <a href='http://nightbot.tv' target='_blank'>Nightbot</a>?",
    "opt_8": "Nightbot API details",
    "opt_8_username": "Username",
    "opt_9": "Check stream is live before saving?",
    "opt_10": "Stream details",
    "opt_10_select": "Select Service",
    "opt_10_select_justin": "Justin.tv",
    "opt_10_select_twitch": "Twitch",
    "opt_11": "Clear the file(s) automatically",
    "opt_12": "Activate browser notifications",
    "opt_13": "Append to output",
    "opt_14": "Custom message",
    "opt_tt_0": "The directory where the now playing file is saved, may also be used for caching stream status",
    "opt_tt_1": "The file format that the now playing file is saved as. Xsplit supports both XML and TXT, OBS just supports TXT. XML allows you display different info in different text titles in your scenes",
    "opt_tt_2": "Don't include file extension",
    "opt_tt_3": "For the list of available variables and which sites support them, and examples <a href='/sites'>click here</a>.<br/>OBS users using the &quot;Scroll&quot; option may need to add a few spaces to the end of this option to prevent the first and last word from merging",
    "opt_tt_4": "The maximum length of 'Now Playing', Artist, Track, Album variables. Must be a number between 10 and 256",
    "opt_tt_5": "The album artwork will be saved to &quot;SaveDirectory/unp_album_art.jpg&quot;. PNG album art is sent to a server operated by the developer, which converts the image to JPG for the extension to download and save. For the list of supported sites, <a href='/sites'>click here</a>",
    "opt_tt_6": "Prevent UNP processing YouTube",
    "opt_tt_7": "Send now playing data to Nightbot, which will allow viewers to recieve now playing information via twitch/justin tv chat. To do this, create a custom command in the Nightbot.tv panel, for more information see the <a href='http://wiki.nightbot.tv/chat:variables' target='blank'>Nightbot wiki</a><br /><br />Please note, Nightbot isn't operated by the developer of UNP, it's a third party service",
    "opt_tt_8": "Your unique Nightbot API key can be obtained <a href='http://www.nightbot.tv/account' target='_blank'>here</a>",
    "opt_tt_9": "This will check your stream is live before saving any 'Now Playing' data or sending anything to Nightbot. This offers increased privacy, however it requires requests to Justin/Twitch TV, and should only be enabled if you require the extra privacy",
    "opt_tt_10": "Your Stream details, only used if the 'Check stream' option is enabled",
    "opt_tt_11": "The file(s) will be cleared each time a page supported by UNP is closed",
    "opt_tt_12": "This activate browser notification when the music change.",
    "opt_tt_13": "This causes the output file when txt, to be appended instead of overwritten each time.",
    "opt_tt_14": "This custom message will be written instead",
    "sites_des": "This is a list of the supported sites, and their available features. <strong>This information is only for users who want more customisation, and is irrelevant for the majority of users.</strong> The symbols in brackets are the variables used for formatting the 'Plain text' save as option.",
    "sites_des_2": "<strong>'Now Playing' (%s%), 'Time Started' (%t%) and 'URL' (%u%) variables are fully supported by every site.</strong> The magnifying glass icon denotes sites which don't display the artist and title information seperately, for these sites UNP will try to split the information into Artist and Title, but accuracy can't be guaranteed.",
    "sites_th_artist": "Artist (%a%)",
    "sites_th_title": "Title (%e%)",
    "sites_th_duration": "Duration (%d%)",
    "sites_th_album": "Album (%b%)",
    "sites_th_artwork": "Artwork (N/A)",
    "sites_note_2": "*: Xiami radio is not supported because of flash player. Please use xiami player page.",
    "sites_var_list": "Full list of Variables",
    "sites_var_s": "Now Playing data",
    "sites_var_a": "Artist",
    "sites_var_e": "Title",
    "sites_var_b": "Album",
    "sites_var_d": "Total Duration",
    "sites_var_t": "Time started (24hr)",
    "sites_var_u": "URL of page",
    "sites_var_n": "New line",
    "sites_example": "Plain Text Format Examples",
    "sites_example_1": "If you listen to GrooveShark, and your plain text format is set to:",
    "sites_example_2": "The output will be:",
    "sites_des_3": "Support for more sites will be added over time. If you have a suggestion for a site, please <a href='/contact'>contact me</a>.",
    "about_des": "'Untamed Now Playing' is a Firefox extension which parses the song title and artist from popular online radio/music sites, and writes it to a file on your hard drive. Programs such as Xsplit or OBS can then read the file and display it on an overlay, allowing viewers to easily see what song is currently being played. Created by Untamed; improved and ported on Firefox by Wykks.",
    "about_limi": "Limitations",
    "about_limi_1": "At the moment, now playing data is only saved when the song intially plays and is only updated when the next song starts playing. Thus if you stop playing music, the output file will still contain the last song played.",
    "about_limi_2": "Firefox limits what directories can be saved to, if you run into problems, try saving to a subdirectory of your profile (C:\\Users\\USERNAME* or C:\\Documents and Settings\\USERNAME*).",
    "about_license": "License",
    "about_license_1": "This software is provided 'AS IS' without warranty of any kind, either expressed or implied. Licensed under a MIT.",
    "about_license_2": "This software uses the following libraries developed by third parties;",
    "about_license_3": "Additionally, the main icon was designed by <a target='_blank' href='http://csscreme.com/freeicons/'>CSS Creme</a>.",
    "contact_1": "If you have any suggestions, feedback, etc, you can post on <a target='_blank' href='http://obsproject.com/forum/viewtopic.php?f=22&amp;t=2614'>OBS forum</a> or on <a target='_blank' href='https://github.com/Wykks/Untamed-Now-Playing-Next'>GitHub</a>.",
    "contact_2": "",
    "warn_opt": "<strong>Warning!</strong><br />You need to configure UNP! The main option is the 'Save to directory', set a directory where the now playing information will be saved. If you run into any problems, notify me (my contact info is available <a href='#/contact' style='color:#7C6238'>here</a>).",
    "err_directory_win": "Error: Save directory cannot have 'windows' in the path",
    "err_directory_unable": "Error: Unable to read save directory.<br><br>Firefox can limit readable/writable directories, if you run into problems, try changing the folder to your 'My Documents' or a subdirectory of that folder eg: 'C:\\Users\\Sam\\Documents\\UNP\\'",
    "err_directory_inaccess": "Error: Unable to write to save directory",
    "err_fmt_invalid": "Error: Save as format is invalid",
    "err_fmt_toolong": "Error: Plain text format must be less than 512 chars",
    "err_maxlen_invalid": "Error: Song maximum length must be a number between 10 and 256",
    "err_nightbot_user": "Error: Nightbot user is missing or invalid format",
    "err_nightbot_key": "Error: Nightbot API key is missing or invalid format",
    "err_stream_service": "Error: Stream service is missing or invalid",
    "err_stream_user": "Error: Stream user is missing or invalid"
}
